SO/Scenario 1.5/SO_27_Get_SO_Sync_to_Kafka_All.yaml
config:
  target: "https://moonlay-api.dbo.dev"
  phases:
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
    - duration: 1
      arrivalRate: 150
    - duration: 9
      arrivalRate: 15
scenarios:
  - flow:
      - get: 
          url: "/order-srv/sales-orders/event-logs?request_id=762a758d-0c3c-4c40-902a-df5fa69c4e03"
          headers:
            Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="